In [1]:
import pandas as pd

In [2]:
#Answer-1
df = pd.DataFrame([[7,20,1],[10,35,3],[15,45,10]],columns = ["Age","Weight","Class"],index =[1,2,3] )

In [3]:
df

   Age  Weight  Class
1    7      20      1
2   10      35      3
3   15      45     10

In [4]:
df.head(1)

   Age  Weight  Class
1    7      20      1

In [5]:
df.tail(1)

   Age  Weight  Class
3   15      45     10

In [6]:
#df["Class"]

In [7]:
#df[["Age","Weight"]]

In [8]:
#df["New_columns"] = "vishal"

In [9]:
#df["New_columns"][2]

In [10]:
df.index = [0,1,2]

In [11]:
df

   Age  Weight  Class
0    7      20      1
1   10      35      3
2   15      45     10

In [12]:
df.describe()

             Age     Weight      Class
count   3.000000   3.000000   3.000000
mean   10.666667  33.333333   4.666667
std     4.041452  12.583057   4.725816
min     7.000000  20.000000   1.000000
25%     8.500000  27.500000   2.000000
50%    10.000000  35.000000   3.000000
75%    12.500000  40.000000   6.500000
max    15.000000  45.000000  10.000000

In [13]:
df.max()

Age       15
Weight    45
Class     10
dtype: int64

In [14]:
#Answer-2
df1 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12],[13,14,15],[16,17,18]],columns = ["A","B","C"])
df1

    A   B   C
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15
5  16  17  18

In [15]:
df1.reindex([1,3,5,6,7,8])

      A     B     C
1   4.0   5.0   6.0
3  10.0  11.0  12.0
5  16.0  17.0  18.0
6   NaN   NaN   NaN
7   NaN   NaN   NaN
8   NaN   NaN   NaN

In [16]:
#Answewr-3
df2 = pd.DataFrame([[10,20,30],[40,50,60],[70,80,90]],columns = ["A","B","C"])

In [17]:
df2

    A   B   C
0  10  20  30
1  40  50  60
2  70  80  90

In [18]:
df2["A"]+df2["B"]+df2["C"]

0     60
1    150
2    240
dtype: int64

In [19]:
#Answer-4
df3 = pd.DataFrame({"Text":["my name is vishal","i am try to run my code","i have dane B.tech"]})

In [20]:
df3

                      Text
0        my name is vishal
1  i am try to run my code
2       i have dane B.tech

In [21]:
df3["Word_Count"]=df3["Text"].apply(lambda x:len(x.split()))
df3

                      Text  Word_Count
0        my name is vishal           4
1  i am try to run my code           7
2       i have dane B.tech           4

In [22]:
#Answer-5
# Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.
df2.size

9

In [23]:
# Returns tuple of shape (Rows, columns) of dataframe/series.
df2.shape

(3, 3)

In [24]:
#Answer-6
#pd.read_excel("put here link that you want to read")

In [25]:
#Answer-7
df7 =pd.DataFrame({"Email":["vishal@gmail.com","ram@gamil.com","mohit@gmail.com","karan@gmail.com","gaurav@gmail.com"]})
df7

              Email
0  vishal@gmail.com
1     ram@gamil.com
2   mohit@gmail.com
3   karan@gmail.com
4  gaurav@gmail.com

In [26]:
#answer-7
df7["Username"]=df7["Email"].apply(lambda x:x.split("@")[0])

In [27]:
df7

              Email Username
0  vishal@gmail.com   vishal
1     ram@gamil.com      ram
2   mohit@gmail.com    mohit
3   karan@gmail.com    karan
4  gaurav@gmail.com   gaurav

In [28]:
#Answer-8
df8 = pd.DataFrame([[3,5,1],[8,2,7],[6,9,4],[2,3,5],[9,1,2]],columns = ["A","B","C"])
df8

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [29]:
df8[(df8["A"]>5) & (df8["B"]<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [30]:
#Answer-9
df9 = pd.DataFrame([[1,2,3],[50,40,60],[25,50,75]],columns = ["Values","B","C"])
df9

   Values   B   C
0       1   2   3
1      50  40  60
2      25  50  75

In [31]:
df9["Values"].mean()

25.333333333333332

In [32]:
df9["Values"].median()

25.0

In [33]:
df9["Values"].std()

24.5017006212494

In [37]:
#Answer-11
date = pd.date_range(start = "2023-03-12", end = "2023-03-25")
df11 = pd.DataFrame({"date":date})

In [44]:
df11["Weekday"]=df11["date"].dt.day_name()

In [45]:
df11

         date    Weekday
0  2023-03-12     Sunday
1  2023-03-13     Monday
2  2023-03-14    Tuesday
3  2023-03-15  Wednesday
4  2023-03-16   Thursday
5  2023-03-17     Friday
6  2023-03-18   Saturday
7  2023-03-19     Sunday
8  2023-03-20     Monday
9  2023-03-21    Tuesday
10 2023-03-22  Wednesday
11 2023-03-23   Thursday
12 2023-03-24     Friday
13 2023-03-25   Saturday

In [48]:
#Answer-12
date1 = pd.date_range(start = "2022-12-31",end = "2023-5-5")
df12  = pd.DataFrame({"date":date1})
df12[(df12["date"]>"2023-01-01") & (df12["date"]<"2023-1-31")]

         date
2  2023-01-02
3  2023-01-03
4  2023-01-04
5  2023-01-05
6  2023-01-06
7  2023-01-07
8  2023-01-08
9  2023-01-09
10 2023-01-10
11 2023-01-11
12 2023-01-12
13 2023-01-13
14 2023-01-14
15 2023-01-15
16 2023-01-16
17 2023-01-17
18 2023-01-18
19 2023-01-19
20 2023-01-20
21 2023-01-21
22 2023-01-22
23 2023-01-23
24 2023-01-24
25 2023-01-25
26 2023-01-26
27 2023-01-27
28 2023-01-28
29 2023-01-29
30 2023-01-30

In [49]:
#Answer- 13
#According to me there are so library are important
#df.head()
#df.tail()
#df.apply
#df.max
#df.min
#df.size
#df.shape
#df.describe